/* original app has been modified and moved */
"%1$@ has been updated and moved. Do you want to change all your keychain items to allow the new version access to your keychain?" = "%1$@ został uaktualniony lub przeniesiony. Czy chcesz zmienić wszystkie pozycje pęku kluczy, by pozwolić nowej wersji na dostęp do pęku kluczy?";

/* original app has been updated (paths equal) v2 */
"%1$@ has been updated. Do you want to allow the new version to access the same keychain items (such as passwords) as the previous version?" = "Proces %1$@ został uaktualniony. Czy akceptujesz dostęp nowej wersji do tych samych elementów pęku kluczy (np. hasła) co poprzednia wersja?";

/* original app has been updated (paths equal) */
"%1$@ has been updated. Do you want to change all your keychain items to allow the new version access to your keychain?" = "%1$@ został uaktualniony. Czy chcesz zmienić wszystkie pozycje pęku kluczy, by pozwolić nowej wersji na dostęp do pęku kluczy?";

/* Descriptive text for when the app doesn't match the item's ACL. */
"%1$@ may have been updated or changed, perhaps during a software update. Because of this you need to allow permission to use the keychain item." = "Program %1$@ uaktualniony lub zmieniony, prawdopodobnie podczas uaktualniania oprogramowania. Z tego powodu musisz zezwolić na użycie elementu z pęku kluczy.";

/* Descriptive text for when the app doesn't match the item acls in a keychain's items. */
"%1$@ may have been updated or changed, perhaps during a software update. Because of this you need to allow permission to use the keychain." = "Program %1$@ uaktualniony lub zmieniony, prawdopodobnie podczas uaktualniania oprogramowania. Z tego powodu musisz zezwolić na użycie pęku kluczy.";

/* Confirm Access message text when operation is unknown. %1$@ is replaced by the name of the application making the request, %2$@ is replaced by the label of the key affected. */
"%1$@ wants to access key \\U201C%2$@\\U201D in your keychain." = "Program %1$@ potrzebuje dostępu do klucza „%2$@” w Twoim pęku kluczy.";

/* Confirm Access message text when attempting to generate a key. %1$@ is replaced by the name of the application making the request, %2$@ is replaced by the label of the key being generated. */
"%1$@ wants to add the  \\U201C%2$@\\U201D item to your keychain." = "Program %1$@ chce dodać rzecz „%2$@” do Twojego pęku kluczy.";

/* Confirm Access message text when attempting to modify the ACL of a key. %1$@ is replaced by the name of the application making the request, %2$@ is replaced by the label of the key of which the ACL is being changed. */
"%1$@ wants to change access permissions of the \\U201C%2$@\\U201D item in your keychain." = "Program %1$@ chce zmienić uprawnienia rzeczy „%2$@” w Twoim pęku kluczy.";

/* Confirm Access message text when attempting to modify the owner of a key. %1$@ is replaced by the name of the application making the request, %2$@ is replaced by the label of the key of which the owner is being changed. */
"%1$@ wants to change the owner of the \\U201C%2$@\\U201D item in your keychain (the owner of the item is the one allowed to change access permissions)." = "Program %1$@ chce zmienić właściciela rzeczy „%2$@” w Twoim pęku kluczy (tylko właściciel tej rzeczy może zmienić uprawnienia dostępu).";

/* Confirm Access message text when attempting to decrypt using a key. %1$@ is replaced by the name of the application making the request, %2$@ is replaced by the label of the key being used. */
"%1$@ wants to decrypt the \\U201C%2$@\\U201D item in your keychain." = "Program %1$@ chce odszyfrować rzecz „%2$@” w Twoim pęku kluczy.";

/* Confirm Access message text when attempting to delete a key. %1$@ is replaced by the name of the application making the request, %2$@ is replaced by the label of the key being being deleted. */
"%1$@ wants to delete the \\U201C%2$@\\U201D item from your keychain." = "Program %1$@ chce usunąć rzecz „%2$@” z Twojego pęku kluczy.";

/* Confirm Access message text when attempting to derive a key from a key. %1$@ is replaced by the name of the application making the request, %2$@ is replaced by the label of the key being used to derive a key from. */
"%1$@ wants to derive a key from key \\U201C%2$@\\U201D in your keychain." = "Program %1$@ chce utworzyć klucz pochodny z „%2$@” w Twoim pęku kluczy.";

/* Confirm Access message text when attempting to encrypt using a key. %1$@ is replaced by the name of the application making the request, %2$@ is replaced by the label of the key being used. */
"%1$@ wants to encrypt using key \\U201C%2$@\\U201D in your keychain." = "Program %1$@ chce zaszyfrować przy użyciu klucza „%2$@” z Twojego pęku kluczy.";

/* Confirm Access message text when attempting to export a key in wrapped form. %1$@ is replaced by the name of the application making the request, %2$@ is replaced by the label of the key being exported. */
"%1$@ wants to export key \\U201C%2$@\\U201D from your keychain." = "Program %1$@ chce wyeksportować klucz „%2$@” z Twojego pęku kluczy.";

/* Confirm Access message text when attempting to import a key. %1$@ is replaced by the name of the application making the request, %2$@ is replaced by the label of the key being imported. */
"%1$@ wants to import key \\U201C%2$@\\U201D into your keychain." = "Program %1$@ chce zaimportować klucz „%2$@” do Twojego pęku kluczy.";

/* Confirm Access message text when attempting to sign using a key. %1$@ is replaced by the name of the application making the request, %2$@ is replaced by the label of the key being used. */
"%1$@ wants to sign using key \\U201C%2$@\\U201D in your keychain." = "Program %1$@ chce podpisać, używając klucza „%2$@” z Twojego pęku kluczy.";

/* Confirm Access message text when attempting to sign using a key. %1$@ is replaced by the name of the application making the request, %2$@ is replaced by the label of the key being used. */
"%1$@ wants to sign with key \\U201C%2$@\\U201D in your keychain." = "Program %1$@ chce podpisać kluczem „%2$@” z Twojego pęku kluczy.";

/* Unlock reason */
"%1$@ wants to use the \\U201C%2$@\\U201D keychain." = "Program %1$@ chce użyć pęku kluczy „%2$@”.";

/* Confirm Access message text when attempting to decrypt using a groupkey. %1$@ is replaced by the name of the application making the request. %2$@ says '...allow?' or '...enter keychain password' if password is required for the operation. */
"%1$@ wants to use your .Mac password. %2$@" = "%1$@ chce użyć Twojego hasła .Mac. %2$@";

/* Confirm Access message text when attempting to decrypt using a groupkey. %1$@ is replaced by the name of the application making the request, %2$@ is replaced by the label of the key being used. */
"%1$@ wants to use your confidential information stored in \\U201C%2$@\\U201D in your keychain." = "%1$@ chce użyć twoich poufnych danych przechowywanych w „%2$@” w Twoim pęku kluczy.";

/* Part of the Confirm Access message text when application fails static code-signing verification.  %1$@ is replaced by the name of the application making the request. */
"\\U201C%1$@\\U201D has been altered on disk. You might be running something that is pretending to be \\U201C%1$@\\U201D." = "Program %1$@ został zmodyfikowany na dysku. Masz uruchomione coś, co symuluje program %1$@.";

/* Part of the Confirm Access message text when application has failed dynamic code-signing verification.  %1$@ is replaced by the name of the application making the request. */
"\\U201C%1$@\\U201D has been modified while running and no longer conforms to what was installed on disk." = "Program %1$@ został zmodyfikowany podczas pracy i nie jest zgodny z tym, co zainstalowano na dysku.";

/* Part of the Confirm Access message text when neither a signature nor a path is available to verify the application. */
"\\U201C%1$@\\U201D is unknown. Access is denied." = "„%1$@” jest nieznany. Dostęp zabroniony.";

/* new app introduced, give it access? */
"An application named %1$@ needs to access your keychain, but there is an existing version. Do you want to change all your keychain items to allow the new version access to your keychain?" = "Program %1$@ wymaga dostępu do Twojego pęku kluczy, lecz taki program już istnieje. Czy chcesz zmienić wszystkie pozycje pęku kluczy, by pozwolić nowej wersji na dostęp do pęku kluczy?";

/* AppType */
"Application:" = "Program:";

/* Authentication no longer needed */
"Authentication is no longer needed." = "Uwierzytelnienie już nie jest wymagane.";

/* Cancel button title */
"Cancel" = "Anuluj";

/* changed application wanting access */
"Changed Process:" = "Proces zmieniony:";

/* confirm that a application changed panel title string */
"Confirm Application Change" = "Potwierdź zmianę programu";

/* Copy Location To Clipboard SFURLView menu item */
"Copy Location To Clipboard" = "Kopiuj lokację do Schowka";

/* Detail disclosure button label.  Details about authorization requests. */
"Detail" = "Szczegóły";

/* Do you want to allow access to this item? */
"Do you want to allow access to this item?" = "Czy chcesz zezwolić na dostęp do tej rzeczy?";

/* Do you want to allow this? */
"Do you want to allow this?" = "Czy chcesz na to zezwolić?";

/* Password for a newly created keychain, change keychain password. */
"Enter a new password for the keychain \\U201C%1$@.\\U201D" = "Podaj nowe hasło do pęku kluczy „%1$@”.";

/* When configuring a keychain on additional Macs (non-login kc) */
"Enter the password for keychain \\U201C%1$@\\U201D on \\U201C%2$@\\U201D." = "Podaj hasło dostępu do pęku kluczy „%1$@” w „%2$@”.";

/* Enter the password for keychain \\U201C%1$@\\U201D on one of the computers you have synchronized. */
"Enter the password for keychain \\U201C%1$@\\U201D on one of the computers you have synchronized." = "Podaj hasło pęku kluczy „%1$@” na jednym ze zsynchronizowanych komputerów.";

/* Part of the Confirm Access message text when application signature cannot be verified.  %1$@ is replaced by the name of the application making the request. */
"It is not possible to tell whether \\U201C%1$@\\U201D is unchanged from the last time it was used. Someone could have modified or replaced it." = "Nie można określić, czy program %1$@ uległ modyfikacji od momentu ostatniego użycia. Ktoś mógł go naruszyć lub zastąpić.";

/* Keychain Access application's name */
"Keychain Access.app" = "Keychain Access.app";

/* When referring to a faceless application or tool that represents the system, Mac OS X, your computer, your system, this replaces the client name in the authentication dialog */
"Mac OS X" = "Mac OS X";

/* Shown instead of Password: when asking the user to provide a new password or change an old one. */
"New Password:" = "Nowe hasło:";

/* No button title */
"No" = "No";

/* Sometimes no password is required and the field is inactive.  This string is set in it as a placeholder. */
"Not required." = "Nie jest wymagane.";

/* OK button title */
"OK" = "OK";

/* Show user provided hint to help remember password */
"Password hint: \\U201C%1$@\\U201D." = "Podpowiedź hasła: „%1$@”.";

/* In the case of a smartcard instead of a keychain, the PIN label is substituted where the Password label is. */
"PIN:" = "PIN:";

/* Unlock reason detail */
"Please enter the keychain password." = "Podaj hasło pęku kluczy.";

/* Typical pwd suggestion */
"Secure passwords typically are longer than 6 characters and should not contain obvious words like dog, cat, and so on." = "Bezpieczne hasła są zwykle dłuższe niż 6 znaków i nie powinny zawierać oczywistych słów jak pies, kot itp.";

/* Authentication unable to continue */
"Sorry, unable to continue the authentication." = "Niestety, nie można kontynuować uwierzytelnienia.";

/* Unlock unable to continue */
"Sorry, unable to continue the unlock." = "Niestety, nie mogę kontynuować odblokowania.";

/* Authentication canceled */
"Sorry, you attempted to authenticate too many times." = "Niestety, próbujesz uwierzytelnienia zbyt wiele razy.";

/* NewPwd canceled */
"Sorry, you attempted to set your password for the \\U201C%1$@\\U201D keychain too many times." = "Niestety, podjętych przez Ciebie prób ustawienia hasła dla pęku kluczy „%1$@” było zbyt wiele.";

/* Unlock canceled */
"Sorry, you attempted to unlock \\U201C%1$@\\U201D too many times." = "Niestety, zbyt wiele razy próbowano odblokować „%1$@”.";

/* Unlock failed; invalid password */
"Sorry, you entered an invalid password." = "Niestety, podane hasło jest niepoprawne.";

/* For referring to the system keychain. */
"System" = "System";

/* Application with same name is different and possibly in a different location as well. */
"The \\U201C%1$@\\U201D software on your computer has changed and wants to access your keychain." = "Program %1$@ uległ zmianie i wymaga dostępu do Twojego pęku kluczy.";

/* Part of the Confirm Access informational text when application is unsigned.  %1$@ is replaced by the name of the application making the request. */
"The authenticity of \\U201C%1$@\\U201D cannot be verified." = "Nie można potwierdzić autentyczności „%1$@”.";

/* error after succefully entering a password which then fails to get added to a keychain. */
"The item could not be added to your default keychain." = "Tej rzeczy nie można było dodać do domyślnego pęku kluczy.";

/* detailed message for allowing a process to have the same access as original app v2. */
"The keychain items may include passwords and other important information. If you click Allow, the new version of \\U201C%1$@\\U201D will have access to all the keychain items used by previous version. This change is permanent." = "Rzeczy w pęku kluczy mogą być na przykład hasłami lub innymi ważnymi informacjami. Jeśli klikniesz w Pozwól, nowa wersja „%1$@” będzie miała dostęp do wszystkich rzeczy w pęku kluczy, których używała wersja poprzednia. Ta zmiana jest trwała.";

/* Authentication failed; invalid username or password */
"The name or password you entered is incorrect." = "Podany użytkownik lub hasło jest nieprawidłowe.";

/* detailed message for allowing a process to have the same access as original app. */
"This change is permanent and affects all keychain items in all your keychains." = "Ta zmiana jest trwała i ma wpływ na wszystkie elementy we wszystkich pękach kluczy.";

/* Application with same name is different and possibly in a different location as well. */
"This is a new version of the application \\U201C%1$@\\U201D. Do you want to allow it to access the same keychain items as the previous version?" = "Jest to nowa wersja programu „%1$@”. Czy chcesz zezwolić jej na dostęp do tych samych elementów pęku kluczy co poprzednia wersja?";

/* When configuring a keychain on additional Macs - details text */
"This is the same password you used to first synchronize your keychain \\U201C%@\\U201D with .Mac." = "To jest to samo hasło, którego użyto do pierwszej synchronizacji pęku kluczy „%@” z .Mac.";

/* Please enter the keychain password. */
"To allow this, enter the \\U201C%1$@\\U201D keychain password." = "By na to zezwolić, podaj hasło do pęku kluczy „%1$@”.";

/* When configuring a keychain on additional Macs (login kc) */
"To synchronize your keychain on this computer, enter the password for your user account on \\U201C%1$@\\U201D." = "Aby zsynchronizować pęk kluczy na tym komputerze, podaj hasło swojego konta użytkownika na „%1$@”.";

/* To synchronize your keychain on this computer, enter your user account password for any of the computers you synchronize. */
"To synchronize your keychain on this computer, enter your user account password for any of the computers you synchronize." = "Aby zsynchronizować pęk kluczy na tym komputerze, podaj hasło swojego konta użytkownika na dowolnym z synchronizowanych komputerów.";

/* ToolType */
"Tool:" = "Narzędzie:";

/* Try again later */
"Try again later." = "Spróbuj ponownie później.";

/* Please Try again */
"Try entering your information again." = "Spróbuj podać informacje ponownie.";

/* Authenticate greeting changing the system certificate Trust Settings. */
"Type an administrator's name and password to make changes to the System Certificate Trust Settings." = "Wpisz nazwę i hasło administratora, by dokonać zmian w Ustawieniach zaufania certyfikatów systemowych.";

/* Authenticate greeting for a non-admin asking to authenticate as an admin.  %1$@ gets replaced with Application name, or the localized string representing the system (Mac OS X). */
"Type an administrator\\U2019s name and password to allow %1$@ to make changes." = "Podaj nazwę i hasło administratora, by zezwolić użytkownikowi %1$@ na dokonywanie zmian.";

/* Authenticate greeting for any group.  %1$@ gets replaced with group name and %2$@ gets replaced with the calling Application's name, or the localized string representing the system (Mac OS X). */
"Type the name and password of a user in the \\U201C%1$@\\U201D group to allow %2$@ to make changes." = "Podaj nazwę i hasło użytkownika z grupy „%1$@, by zezwolić programowi %2$@ na dokonywanie zmian.";

/* Authenticate greeting for an admin, or a user that can authorize.  %1$@ gets replaced with Application name, or the localized string representing the system (Mac OS X). */
"Type your password to allow %1$@ to make changes." = "Wpisz swoje hasło, aby zezwolić programowi %1$@ na dokonywanie zmian.";

/* Authenticate greeting changing the per-user certificate Trust Settings. */
"Type your password to make changes to your Certificate Trust Settings." = "Wpisz nazwę i hasło, aby dokonać zmian w Ustawieniach zaufania certyfikatów.";

/* UnkownProcessType */
"Unknown:" = "Nieznany:";

/* Unlock no longer needed */
"Unlock is no longer needed." = "Odblokowanie nie jest już wymagane.";

/* Yes button title */
"Yes" = "Tak";

/* pwd is blank */
"You have not provided a password. Please specify one." = "Nie podano hasła. Podaj hasło.";

/* pwd too simple */
"You have specified a non-secure password. Please use a longer one." = "Podane hasło nie jest bezpieczne. Użyj dłuższego hasła.";

/* used that pwd before */
"You have used that password before. Please use a different one." = "To hasło było już używane. Użyj innego hasła.";

/* Authentication failure for admin group.  %1$@ gets replaced with Application name. */
"You must type an administrator\\U2019s name and password to make changes to %1$@." = "Musisz podać nazwę i hasło administratora, by dokonać zmian w %1$@.";

/* Authentication failure for any group.  %1$@ gets replaced with group name and %2$@ gets replaced with the calling Application's name. */
"You must type the name and password of a user in the \\U201C%1$@\\U201D group to make changes to %2$@." = "Musisz podać nazwę i hasło użytkownika w grupie „%1$@”, by dokonać zmian w %2$@.";

/* NewPwd verify not equal */
"Your password is not the same as the verify password." = "Hasło nie jest takie samo jak hasło zweryfikowane.";

/* pwd unacceptable */
"Your password is unacceptable." = "Hasło jest niedopuszczalne.";

